package gameplay;

public final class Message {

    final static String PREFACE = """
            🌿🐺 Симуляция экосистемы: Волки и зайцы
            Добро пожаловать в мир, где волки и зайцы борются за выживание. Симуляция продолжается, пока не останется только один вид существ.
            
            🧩 Обозначения на поле
            Каждая сущность представлена заглавной буквой английского алфавита:
            H — Заяц (Hare)
            W — Волк (Wolf)
            G — Трава (Grass)
            R — Камень (Rock) — непроходимый объект
            
            ❤️ Механика здоровья
           Каждый ход существо теряет или восстанавливает здоровье в зависимости от действий:
           Действие                             Изменение здоровья
           Заяц поедает траву                   +4 HP
           Волк атакует зайца                   Волк: +4 HP, Заяц: –4 HP
           Перемещение без цели или голод       –1 HP
           
           *Если путь к цели заблокирован (камнями или границами), существо не может добраться до неё и теряет 1 HP от голода.
           
           📊 Параметры существ
           Существо                   Здоровье                   Скорость                   Атака
           Заяц                       10 HP                      3 клетки/ход                —
           Волк                       2 HP                       1 клетка/ход                3
           
           🌱 Восстановление ресурсов
           Трава (G) периодически восстанавливается на поле, обеспечивая зайцев пищей.
           
           👶 Размножение
           Если существо выживает 5 ходов подряд, оно производит потомство.
           Ограничение: на поле действует лимит на общее количество особей каждого вида (во избежание перенаселения).
           
           ▶️ Начало игры
           Задайте размеры игрового поля для симуляции:
           ⚠️ Количество строк и столбцов должно быть в диапазоне от 5 до 50 включительно.
                """;

    final static String COLUMN_QUERY="Колличество столбцов:";
    final static String LINE_QUERY="Колличестов строк:";
    final static String MESSAGE_CREATION_WORLD="Мир создан!";
    final static String ASSERTION_POSITION_ENTITIES="""
                    Нажмите 1 что бы продолжить.
                    Нажмите 2 что бы изменить расположение объектов по умолчанию.
                    """;
    final static String MAKE_MOVE="""
                Нажмите 1 что бы сделать ход всеми существами.
                Нажмите 2 что бы запустить режим постоянного взаимодействия.
                """;
    final static String VICTORI_HERBIFORE="""
                        -------------Конец---------------
                        Зайцы победили!!!
                        """;
    final static String VICTORI_PREDATOR="""
                        -------------Конец---------------
                        Волки победили!!!
                        """;
    final static String INVALID_FORMAT_LIMIT_FIELD ="Неверный формат, нужно ввести натуральное число.";
    final static String INVALID_CONDITION="Это число, но оно не входит в диапозн от 5 до 50.";
    final static String INVALID_FORMAT_INPUT="""
                    Неверный ввод
                    Нужно ввести цифру от 1 до 2.
                    """;

    final static String SETTING_PAUSE="Для постановки на паузу нажмите 3";
    final static String CONTINUATION_SIMULATION="Симуляция находится на паузе, нажмите 4 что бы продолжить";
    final static String END="Конец!!!";
}
